{"pageProps":{"job":{"id":6,"company":"Creative","logo":"/devjobs-web-app/assets/logos/creative.svg","logoBackground":"hsl(295, 55%, 21%)","position":"Desktop Support Manager","postedAt":"4d ago","contract":"Part Time","location":"Germany","website":"https://example.com/creative","apply":"https://example.com/creative/apply","description":"Creative is seeking a Desktop Support Manager responsible for managing and leading a high-performance team in a dynamic environment. The ideal candidate should have management experience, a strong technical skillset, exceptional client service skills and enjoy mentoring a team.","requirements":{"content":"You are likely someone with a solid background in end-user support and troubleshooting, as this position involves dealing with a large, and often changing, number of day-to-day issues which arise in supporting the information technology requirements of our applications.","items":["Bachelor’s degree in IT or related field","5+ years demonstrating strong technical skills supporting end users","3+ years in a leadership capacity (Team Lead, Supervisor, or Manager)","Experience using Professional Services Automation (PSA) tools or ticketing platforms such as ConnectWise, Autotask, ServiceNow, etc.","Possess and demonstrate excellent interpersonal/communication skills"]},"role":{"content":"This is an 80% management and 20% hands-on supervisory role where you will be responsible for the support of automation technologies and managing a team of support engineers in a 24x7 high-volume environment.","items":["Lead, coach and manage service desk teams on a daily basis to improve customer service and efficiency","Implement best practices and standardize service desk processes to provide exceptional “white glove” service and deliverable","Oversee the work performed by the team to help prioritize open tickets and tasks","Provide guidance and direction on technical issues","Develop and maintain KPIs for measuring team performance and improving customer experience","Provide status reports to management and collaborate on new initiatives and technical planning"]}}},"__N_SSG":true}