{"pageProps":{"job":{"id":11,"company":"Crowdfund","logo":"/devjobs-web-app/assets/logos/crowdfund.svg","logoBackground":"hsl(157, 57%, 50%)","position":"Fullstack Developer","postedAt":"1mo ago","contract":"Part Time","location":"New Zealand","website":"https://example.com/crowdfund","apply":"https://example.com/crowdfund/apply","description":"Crowdfund is currently expanding and working on revolutionizing the world of raising funds for any project – creative, entrepreneurial or cause-related. Come and join us in this growth! We are looking for an exceptionally talented Fullstack Developer who will become an integral part of the company’s exciting new chapter.","requirements":{"content":"We'd love to hear from you if you take ownership of your work and continuously want to improve the products you've built. We're looking for developers who have an uncanny abilithy to work very well cross-functionality in a flat startup.","items":["4+ years of web development experience","Strong CS fundamentals and problem solving skills","Production expertise with Ruby on Rails [preferred], Python, PHP, Java, or your favorite modern stack","Excellent debugging skills & strong belief in automated testing and coverage","Team player who enjoys mentoring and agile environments","Passion, drive, energy, a sense of humor and a great attitude!"]},"role":{"content":"At Crowdfund, you will have the opportunity to literally change the world and people’s lives by developing new features for our consumer platform to make it even more robust. You’ll work with exceptional developers and there are lots of interesting technical challenges to tackle, including projects dealing with heavy transaction volume, scalability and Big Data.","items":["Build a marketplace that empowers people to follow their dreams!","Architect, design and implement beautiful, performant & scalable Ruby code.","Create features for the international payment system which sees millions of transactions per day.","Extend the reach of our platform APIs."]}}},"__N_SSG":true}