{"pageProps":{"job":{"id":4,"company":"Office Lite","logo":"/devjobs-web-app/assets/logos/officelite.svg","logoBackground":"hsl(227, 62%, 48%)","position":"Senior Application Engineer","postedAt":"2d ago","contract":"Full Time","location":"Japan","website":"https://example.com/officelite","apply":"https://example.com/officelite/apply","description":"Office Lite is seeking a talented and enthusiastic Senior Application Engineer whose primary responsibility is software architecture and development for Office Lite systems. Additional responsibilities include participation in project time/task estimation, code and architecture reviews, providing support for junior developers, documentation of system architecture and a supporting role for all phases of the development life-cycle (project definition, process mapping, architecture, coding, acceptance testing, installation, turnover to support, etc.).","requirements":{"content":"As a hands-on subject matter expert, you will use expert-level engineering knowledge to provide technical support and help translate customer requirements into exciting new product features. You will be working within multi-disciplinary teams to create pervasive simulation solutions, advance your industry knowledge, and grow the business impact.​","items":["Expert Node.js proficiency in a production environment","Proficiency in developing REST APIs","Expert proficiency with relational databases (MySQL) and optimizing SQL queries","Extensive experience with microservices-based architecture in production","Experience with CircleCI, Jenkins or similar CI/CD applications"]},"role":{"content":"You'll work alongside a skilled team of Senior Engineers across five countries participating in system design, architecture, maintenance, and refactoring decisions. You'll be working on new features and integrations and be active in code reviews and coordinating engineering efforts across teams and products.","items":["Administering and configuring software","Identify opportunity and help to implement a monitoring solution for proactive and predictable operations.","Triaging problems with applications - identifying known errors and problem trends and finding permanent solutions through root cause analysis.","Providing level 2 and 3 application support."]}}},"__N_SSG":true}