{"pageProps":{"job":{"id":5,"company":"Pod","logo":"/devjobs-web-app/assets/logos/pod.svg","logoBackground":"hsl(216, 46%, 14%)","position":"Remote DevOps Engineer","postedAt":"2d ago","contract":"Part Time","location":"Japan","website":"https://example.com/pod","apply":"https://example.com/pod/apply","description":"Join our dynamic team in developing Pod’s core products and supporting infrastructure. Our software is currently written in Java, VB.Net, React Native, React JS and others. You will help lead new initiatives to build and improve the testing, staging and deployment solutions. You will interact with all development teams, development leadership and our hosting/IT staff to define requirements and goals for the Dev Ops Platform.","requirements":{"content":"We are looking for talented and motivated engineers who can hit the ground running and take our products to the next level. The engineers who are building our platform across the stack are always willing to go the extra mile to deliver the highest quality software and client experiences. Ideally, you would have:","items":["Bachelor's degree preferred, strong preference for Computer Science field of study","Minimum of 5 years of relevant work experience","Hands-on experience with configuring and maintaining resources on AWS","Experience and solid understanding to deploy and maintain container orchestration platforms such as ECS or Kubernetes","Knowledge of networking fundamentals","Expertise with cloud security, understand the principle of least privilege","Strong written and verbal communication skills"]},"role":{"content":"You will work closely with development teams to implement automation solutions using technologies like Amazon Web Services (AWS), Ansible, Jenkins, and Kubernetes to automatically build, test, integrate, and deploy complex, modern systems. You will leverage the full power of the cloud to configure highly resilient and scalable applications that support zero downtime. This position is open to a mid-level to senior professional depending on experience and background.","items":["Configure and maintain resources on AWS","Maintain infrastructure as code using Terraform, CloudFormation, and/or Ansible","Responsible for production deployments using Jenkins, CodeDeploy, GitHub Actions","Manage security groups and access controls","Use ticket management system such as Jira and Confluence to manage work priorities","Ability to clearly articulate and communicate complex technical ideas to non-DevOps colleagues"]}}},"__N_SSG":true}