{"pageProps":{"job":{"id":7,"company":"Pomodoro","logo":"/devjobs-web-app/assets/logos/pomodoro.svg","logoBackground":"hsl(254, 71%, 45%)","position":"iOS Engineer","postedAt":"1w ago","contract":"Full Time","location":"United States","website":"https://example.com/pomodoro","apply":"https://example.com/pomodoro/apply","description":"We are looking for thoughtful, well-rounded iOS engineer to join our team. We’re looking for someone to help build out the foundation of the app and infrastructure. If you are interested in taking part in building an application that millions of people use every day to increase their productivity, this is the perfect opportunity. You will play an important part in our mobile engineering practice, implementing new features, improving performance, and building beautiful user interfaces.","requirements":{"content":"You are an experienced mobile engineer looking to make Pomodoro one of the best mobile experiences out there. You are someone who excels at customer-centric product development and has a passion for working on application architecture and design, and making smooth, delightful experiences. You care deeply about quality, are energized by partnership and collaboration, and you strive to enable others around you to excel.","items":["Strong programming skills in Objective-C and/or Swift","Previous experience developing mobile applications on iOS","Experience working closely across a variety of teams, including product management, design, and engineering","Knowledge of core CS concepts such as common data structures and algorithms, profiling, and optimization"]},"role":{"content":"You will be responsible for building infrastructure and abstractions to help us double our engineering velocity.  You will work at all layers of the stack and closely with partners across engineering, data science, research, product, and design. You will help our codebase stay ahead of the curve of the constantly evolving development ecosystem.","items":["Design and develop UI components that make feature development faster, baking in consistency and accessibility to the designs","Build frameworks and infrastructure to make product development faster, safer, and more consistent","Improve the performance and stability of the mobile app","Strive to keep the mobile codebase secure"]}}},"__N_SSG":true}