{"pageProps":{"job":{"id":12,"company":"Typemaster","logo":"/devjobs-web-app/assets/logos/typemaster.svg","logoBackground":"hsl(22, 89%, 52%)","position":"Technical Lead Engineer","postedAt":"1mo ago","contract":"Part Time","location":"United Kingdom","website":"https://example.com/typemaster","apply":"https://example.com/typemaster/apply","description":"We are looking for a talented tech lead to join a team that creates large-scale, highly-performant web applications. This team creates highly visible and responsive user interfaces used by millions of people.","requirements":{"content":"Our work is not just about the code: we seek a tech lead who cares deeply about user experience and how their work impacts users. An ideal candidate has extensive experience as a full-stack software engineer, including experience with both Django and React/Redux, our stack. This role is perfect for a seasoned full-stack developer who is looking to grow both as an engineer and technical product owner. We want someone who takes the initiative to learn, enjoys thoughtful code review, and has a history collaborating with other software engineers to develop best patterns and practices.","items":["5-7 years of experience in infrastructure engineering of applications","Experience in web application security analysis and resolution.","Experience working within a modern Javascript workflow through technologies such as: GitHub, CSS Preprocessors, Styled Components, Single Page Application frameworks and Module Bundlers (Webpack etc.)","Experience in implementing A/B Tests","Hands on experience with React/Redux in a production application"]},"role":{"content":"Here's the role: sling code, architect new systems, mentor junior engineers, and manage product as a tech lead on Typemaster’s growing dev team. You will work directly with Typemaster’s two technical co-founders and other engineers in a culture that includes clean code, extensive testing, rapid iteration, and the values you bring to the table. You will come to own one of our product lines, and will have the ability to contribute to multiple projects.","items":["Security audit of web application with an emphasis on commerce/transactional flows","Maintain and improve security skills, knowledge, and training through professional development, including participating in tech conferences and wider tech community forums","Work on a modern stack including React and Django.","Enforce code quality through test driven development via unit tests and automated tests."]}}},"__N_SSG":true}